Revit 2024 API
AssemblyInstance.SetMemberIds Method
 Sets member element ids for the assembly instance. All existing members are cleared.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public void SetMemberIds(
	ICollection<ElementId> memberIds
)
Visual Basic
Public Sub SetMemberIds ( _
	memberIds As ICollection(Of ElementId) _
)
Visual C++
public:
void SetMemberIds(
	ICollection<ElementId^>^ memberIds
)
Parameters
memberIds
Type: System.Collections.Generic.ICollection<ElementId>
 Element ids to set for the assembly instance.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException |  This method may not be called during dynamic update.
See Also
AssemblyInstance Class
Autodesk.Revit.DB Namespace